/* State and Keywordgroupnames */
"Strings in Tags" = "Strings in Tags";
"Attributes in Tags" = "Attributes in Tags";
"Entities" = "Entities";
"Tags" = "Tags";
"Comment" = "<!-- Comment -->";
"CSS Strings in Tags" = "CSS Strings in Tags";
"CSS Attributes in Tags" = "CSS Attributes in Tags";
"CSS Begin and End" = "CSS Begin and End";
"Opening Script Tag" = "Javascript Begin and End";
"ERB Delimiter" = "<%ERB Delimiter%>";
"Ruby" = "Ruby Code";
"SGML Double Dash" = "Invalid SGML Comment Warning";
"CDATA" = "<![CDATA[...]]>";
"Doctype" = "<!Declaration>";
"Escape" = "<?Prologue?>";
"Style Tags" = "Style Tags";
"Opening Style Tag" = "Opening Style Tag";
"Inside curly brackets" = "{CSS inside curly brackets}";
"CSSComment" = "/* CSS Comment */";
"CSSSingleComment" = "// CSS Comment";
"CSSRound bracket" = "(CSS inside parenthesis)";
"CSSString" = "\"CSS Strings\"";
"CSSSingleString" = "'CSS Strings'";
"Inline CSS" = "Inline CSS";
"Script Tags" = "Script Tags";
"JSAutodocComment" = "/*\" Javascript Comment \"*/";
"JSComment" = "/* Javascript Comment */";
"JSSingleComment" = "// Javascript Comment";
"JSRegEx" = "Javascript Regular Expressions";
"JSString" = "\"Javascript Strings\"";
"JSSingleString" = "'Javascript Strings'";
"Inline Javascript" = "Inline Javascript";

"/Ruby/Literals" = "Literals";
"/Ruby/Attribute Definitions" = "Attribute Definitions";
"/Ruby/Definitions" = "Definitions";
"/Ruby/Keywords" = "Keywords";
"/Ruby/Builtin Functions" = "Builtin Functions";
"/Ruby/Builtin Globals" = "Builtin Globals";
"/Ruby/Builtin Classes" = "Builtin Classes";
"/Ruby/Symbols" = ":symbols";
"/Ruby/Numbers" = "Numbers";
"/Ruby/Instance Variables" = "Instance Variables";
"/Ruby/Class Variables" = "Class Variables";
"/Ruby/Global Variables" = "Global Variables";
"/Ruby/String with double quotes" = "\"Strings\"";
"/Ruby/test" = "#{Embedded expressions}";
"/Ruby/String with single quotes" = "'Strings'";
"/Ruby/Backticks" = "`Backticks`";
"/Ruby/Singleline Comment" = "# Comment";
"/Ruby/Regexp" = "Regular expression";
"/Ruby/POD Comments" = "POD Comments";
"/Ruby/HTMLComment" = "<!-- comment -->";
"/Ruby/Heredoc" = ">>HEREDOC String";
"/Ruby/Hexadecimal Characters" = "Hexadecimal Characters";

"/CSS/CSS Attributes" = "CSS Attributes";
"/CSS/CSS Keywords" = "CSS Keywords";
"/CSS/CSS Digits" = "CSS Digits";
"/CSS/CSS Colors" = "CSS Colors";

"/Javascript/Keywords" = "Javascript Keywords";
"/Javascript/Numbers" = "Javascript Numbers";
"/Javascript/Characters" = "Javascript Characters";
"/Javascript/FunctionRegex" = "Javascript Function Calls";
